Question 3(a)

In [22]:
#import mysql.connector as mysql
#from mysql.connector import error
import pyodbc
import pandas as pd

In [2]:
conn = pyodbc.connect('Driver={SQL Server};'
                      'Server=DESKTOP-D283T0R\SQLEXPRESS;'
                      'Database=interviewpython;'
                      'Trusted_Connection=yes;')

cursor = conn.cursor()
#cursor.execute('SELECT * FROM customers')

#for i in cursor:
    #print(i)

In [3]:
cursor.execute('''
                CREATE TABLE customers (CustomerId INT PRIMARY KEY IDENTITY(1,1) ,CustomerName VARCHAR(100) 
                ,CustomerEmail VARCHAR(100) ,CustomerTel VARCHAR(15) , created_at DATETIME, updated_at DATETIME)
    
                ''')
conn.commit()

In [6]:
cursor.execute('SELECT * FROM customers')

for i in cursor:
    print(i)

(1, 'Irfan Bakti', 'irfan88@example.com', '+0123456789', datetime.datetime(2019, 8, 7, 8, 13, 21), datetime.datetime(2019, 8, 7, 8, 13, 21))
(2, 'Jack Smmith', 'jack.smmith@acme.io', '+0132456781', datetime.datetime(2019, 8, 7, 8, 13, 21), datetime.datetime(2019, 8, 7, 8, 13, 21))
(3, 'Nazir', ' ', '+01185434012', datetime.datetime(2019, 8, 7, 8, 13, 21), datetime.datetime(2019, 8, 7, 8, 13, 21))
(4, 'Faiz Ma', 'faiz.ma@jholow.cn', '+019772002', datetime.datetime(2019, 8, 7, 8, 13, 21), datetime.datetime(2019, 8, 7, 8, 13, 21))
(5, 'Isham Rais', 'isham@pmo.gov.my', '+0135482020', datetime.datetime(2019, 8, 7, 8, 13, 21), datetime.datetime(2019, 8, 7, 8, 13, 21))
(6, 'Shanon Teoh', 'shahnon.teoh@st.com.sg', ' ', datetime.datetime(2019, 8, 7, 8, 13, 21), datetime.datetime(2019, 8, 7, 8, 13, 21))

In [8]:
cursor.execute('''
        CREATE TABLE invoices (InvoicesId INT PRIMARY KEY IDENTITY(1,1) ,InvoicesNumber INT 
,InvoicesSub_Total DECIMAL(5,2) ,InvoicesTax_Total DECIMAL(5,2) , InvoicesTotal DECIMAL(5,2), Customer_ID INT, Inv_created_at DATETIME, Inv_updated_at DATETIME)
               ''')

conn.commit()

In [9]:
cursor.execute('''
                INSERT INTO invoices(InvoicesNumber,InvoicesSub_Total,InvoicesTax_Total,InvoicesTotal, Customer_ID,
                Inv_created_at,Inv_updated_at) VALUES 
                (20190001,30.00,0.00,30.00,1, '2019-08-07 08:13:21', '2019-08-07 08:13:2'),
                (20190002,150.00,0.00,150.00,2, '2019-08-07 08:13:21', '2019-08-07 08:13:2'),
                (20190003,30.00,0.00,30.00,2, '2019-08-07 08:13:21', '2019-08-07 08:13:2'),
                (20190004,55.00,0.00,55.00,3, '2019-08-07 08:13:21', '2019-08-07 08:13:2'),
                (20190005,450.00,0.00,0.00,6, '2019-08-07 08:13:21', '2019-08-07 08:13:2')
    
                ''')
conn.commit()

In [10]:
cursor.execute('SELECT * FROM invoices')

for i in cursor:
    print(i)

(1, 20190001, Decimal('30.00'), Decimal('0.00'), Decimal('30.00'), 1, datetime.datetime(2019, 8, 7, 8, 13, 21), datetime.datetime(2019, 8, 7, 8, 13, 2))
(2, 20190002, Decimal('150.00'), Decimal('0.00'), Decimal('150.00'), 2, datetime.datetime(2019, 8, 7, 8, 13, 21), datetime.datetime(2019, 8, 7, 8, 13, 2))
(3, 20190003, Decimal('30.00'), Decimal('0.00'), Decimal('30.00'), 2, datetime.datetime(2019, 8, 7, 8, 13, 21), datetime.datetime(2019, 8, 7, 8, 13, 2))
(4, 20190004, Decimal('55.00'), Decimal('0.00'), Decimal('55.00'), 3, datetime.datetime(2019, 8, 7, 8, 13, 21), datetime.datetime(2019, 8, 7, 8, 13, 2))
(5, 20190005, Decimal('450.00'), Decimal('0.00'), Decimal('0.00'), 6, datetime.datetime(2019, 8, 7, 8, 13, 21), datetime.datetime(2019, 8, 7, 8, 13, 2))

In [11]:
cursor.execute('''
        CREATE TABLE invoice_lines (InvLinesId INT PRIMARY KEY IDENTITY(1,1) ,description VARCHAR(100),
        Unit_Price DECIMAL(5,2), Quantity INT, Sub_Total DECIMAL(5,2), 
        Tax_Total DECIMAL(5,2), Total DECIMAL(5,2), Tax_ID INT, Sku_ID INT, Invoice_ID INT)
               ''')

conn.commit()

In [13]:
cursor.execute('''
                INSERT INTO invoice_lines (Description, Unit_Price, Quantity, Sub_Total, Tax_Total,Total,Sku_ID,Invoice_ID) VALUES 
                ('Book #1',30.00,1,30.00,0.00,30.00,1,1),
                ('Book #2',25.00,4,100.00,0.00,100.00,2,2),
                ('Book #3',50.00,1,50.00,0.00,50.00,3,2),
                ('Book #1',30.00,1,30.00,0.00,30.00,1,3),
                ('Book #1',30.00,1,30.00,0.00,30.00,1,4),
                ('Book #2',25.00,1,25.00,0.00,25.00,2,4),
                ('Book #1',30.00,5,150.00,0.00,150.00,1,5),
                ('Book #3',50.00,6,300.00,0.00,300.00,3,5)
    
                ''')
conn.commit()

In [14]:
cursor.execute('SELECT * FROM invoice_lines')

for i in cursor:
    print(i)

(1, 'Book #1', Decimal('30.00'), 1, Decimal('30.00'), Decimal('0.00'), Decimal('30.00'), None, 1, 1)
(2, 'Book #2', Decimal('25.00'), 4, Decimal('100.00'), Decimal('0.00'), Decimal('100.00'), None, 2, 2)
(3, 'Book #3', Decimal('50.00'), 1, Decimal('50.00'), Decimal('0.00'), Decimal('50.00'), None, 3, 2)
(4, 'Book #1', Decimal('30.00'), 1, Decimal('30.00'), Decimal('0.00'), Decimal('30.00'), None, 1, 3)
(5, 'Book #1', Decimal('30.00'), 1, Decimal('30.00'), Decimal('0.00'), Decimal('30.00'), None, 1, 4)
(6, 'Book #2', Decimal('25.00'), 1, Decimal('25.00'), Decimal('0.00'), Decimal('25.00'), None, 2, 4)
(7, 'Book #1', Decimal('30.00'), 5, Decimal('150.00'), Decimal('0.00'), Decimal('150.00'), None, 1, 5)
(8, 'Book #3', Decimal('50.00'), 6, Decimal('300.00'), Decimal('0.00'), Decimal('300.00'), None, 3, 5)

# Question 3b)

In [19]:
cursor.execute('''
                WITH CTE AS 
(
  SELECT a.Customer_ID, SUM(b.Quantity) AS Quantity
 FROM invoices AS a
 LEFT JOIN invoice_lines AS b ON b.Invoice_ID = a.InvoicesId
 GROUP BY a.Customer_ID
)


select a.customer_ID, a.Quantity
FROM CTE AS a
WHERE a.Quantity > 5
    
                ''')
for i in cursor:
    print(i)

(2, 6)
(6, 11)

# Question 3(c)

In [20]:
cursor.execute('''
   SELECT c.CustomerId, c.CustomerName
   FROM customers AS c
   LEFT JOIN invoices AS i ON i.Customer_ID = c.CustomerId
   WHERE i.InvoicesId IS NULL
    
                ''')
for i in cursor:
    print(i)

(4, 'Faiz Ma')
(5, 'Isham Rais')

# Question 3(d)

In [21]:
cursor.execute('''
    SELECT invoice_lines.description, customers.CustomerName
    FROM invoice_lines
    JOIN invoices 
    ON invoice_lines.Invoice_ID = invoices.InvoicesId
    JOIN customers
    ON customers.CustomerId = invoices.Customer_ID;
    
                ''')
for i in cursor:
    print(i)

('Book #1', 'Irfan Bakti')
('Book #2', 'Jack Smmith')
('Book #3', 'Jack Smmith')
('Book #1', 'Jack Smmith')
('Book #1', 'Nazir')
('Book #2', 'Nazir')
('Book #1', 'Shanon Teoh')
('Book #3', 'Shanon Teoh')

# Question 3(extraction)

In [24]:
sql_query = pd.read_sql_query(''' 
                              select * from interviewpython.dbo.customers
                              '''
                              ,conn) 
df = pd.DataFrame(sql_query)# place 'r' before the path name

In [25]:
sql_query = pd.read_sql_query(''' 
                              select * from interviewpython.dbo.invoices
                              '''
                              ,conn) 

df = pd.DataFrame(sql_query)
df.to_csv (r'D:\Users\Syarifah\Documents\SQL Server Management Studio\invoices.csv', index = False)

In [26]:
sql_query = pd.read_sql_query(''' 
                              select * from interviewpython.dbo.invoice_lines
                              '''
                              ,conn) 

df = pd.DataFrame(sql_query)
df.to_csv (r'D:\Users\Syarifah\Documents\SQL Server Management Studio\invoice_lines.csv', index = False)